driver-tests/pojose/wikiSamples/03_POJO2BPEL/caPOJO2BPEL/src/jbiasa/caPOJO2BPEL.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="caPOJO2BPEL"
             xmlns:tns="caPOJO2BPEL" xmlns:ns="http://openesb.glassfish.org/CallBPEL/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://openesb.glassfish.org/CallBPEL/" location="../jbiServiceUnits/jseCallBPEL/org/glassfish/openesb/CallBPEL.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:CallBPELInterface">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="CallBPELOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="caPOJO2BPEL"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="caPOJO2BPEL"/>
            </output>
        </operation>
    </binding>
    <service name="casaService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService1/casaPort1"/>
        </port>
    </service>
</definitions>
