driver-tests/pojose/wikiSamples/03_POJO2BPEL/caPOJO2BPEL/test/TestPOJO2BPEL/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cap="caPOJO2BPEL">
  <soapenv:Body>
    <cap:CallBPELOperation>
      <part1>John</part1>
    </cap:CallBPELOperation>
  </soapenv:Body>
</soapenv:Envelope>